20250806T084714--kdoc-426-string型の仕様を見る__permanent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-11T23:13:05Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 426: string型の仕様を見る</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 426: string型の仕様を見る</h1>
<div id="outline-container-orge6f06ee" class="outline-2">
<h2 id="orge6f06ee"><a href="#orge6f06ee">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orge6f06ee">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-08-08 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-09-04 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org57d93df" class="outline-2">
<h2 id="org57d93df"><a href="#org57d93df">概要</a></h2>
<div class="outline-text-2" id="text-org57d93df">
<p>
Go言語には組み込みでstring型がある。言語仕様書を見ると、シンプルに書かれている。
</p>

<p>
↓string型はバイト列の並びにすぎない。ここでの言外の着目は、単に「バイト列」にだけ言及しているという点だ。並べ方(エンコーディング。UTF-8など)については一切言及していない。入れる中身に制約はない。
</p>

<blockquote>
<p>
A string value is a (possibly empty) sequence of bytes.
</p>

<p>
&#x2014; <a href="https://go.dev/ref/spec#String_types">string type</a>から抜粋
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-go">import "fmt"
func main() {
        abc := string([]byte{0x41, 0x42, 0x43})
        fmt.Printf("%#v, ", abc)
        あ := string([]byte{0xe3, 0x81, 0x82})
        fmt.Printf("%#v, ", あ)

        // UTF-8として無効
        invalid := string([]byte{0xe3})
        fmt.Printf("%#v, ", invalid)
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">"ABC", "あ", "\xe3",
</pre>
</div>

<p>
len()にstring型を引数にして実行するとバイト数が返ってくる(シーケンスが表現する「文字」数でなく)。string型は単なるバイト列だということを認識すると、一貫性のある挙動に見える。
</p>

<p>
↓いっぽうで、文字列リテラルは、「暗黙的にUTF-8エンコードである」と明記されている。
</p>

<blockquote>
<p>
The value of a raw string literal is the string composed of the uninterpreted (implicitly UTF-8-encoded) characters between the quotes;
</p>

<p>
&#x2014; <a href="https://go.dev/ref/spec#String_literals">string literal</a>から抜粋
</p>
</blockquote>

<p>
であるから、一般的なstring型を初期化する方法である文字列リテラル <code>""</code> でstring型の変数を初期化するとUTF-8の並びのバイト列になるのだが、string型にシーケンスに対する制限があるわけではない。
</p>
</div>
</div>
<div id="outline-container-orgcd7b456" class="outline-2">
<h2 id="orgcd7b456"><a href="#orgcd7b456">関連</a></h2>
<div class="outline-text-2" id="text-orgcd7b456">
<p>
なし。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
